# Developer
#
cask "ghostty"       # terminal emulator
cask "zed"           # text editor (desktop)
cask "intellij-idea" # java IDE
cask "claude-code"   # code agent

brew "gh"      # GitHub CLI
brew "lazygit" # git TUI

brew "docker"         # container CLI
brew "docker-compose" # container orchestration
brew "colima"         # container backend
                      #   (virtualizes Docker in Linux, exposes it to Docker CLI)
brew "lazydocker"     # container TUI

cask "dbngin"    # run local databases
cask "tableplus" # database GUI
cask "rapidapi"  # http/api GUI

tap "oven-sh/bun"
brew "oven-sh/bun/bun" # js/ts toolkit

cask "temurin@17" # JDK 17
cask "temurin@21" # JDK 21
cask "temurin@25" # JDK 25

cask "font-lora"           # serif font
cask "font-ibm-plex-sans"  # sans-serif site font
cask "font-jetbrains-mono" # code font

# Social
#
cask "discord"
cask "signal"

# Game
#
cask "prismlauncher" # minecraft
cask "dolphin"       # emulator: GCN & Wii

# Creative
#
mas "Pixelmator Pro", id: 1289583905 # raster editor
cask "sketch"                        # vector editor
cask "ableton-live-suite"            # digital audio workstation

cask "loopback" # audio router
cask "obs"      # video streaming & recording

# Office
#
mas "Pages",   id: 361309726 # word
mas "Numbers", id: 361304891 # excel
mas "Keynote", id: 361285480 # powerpoint

# Shell
#
brew "fd"            # find
brew "fzf"           # fuzz
brew "starship"      # shell prompt

# Utility
#
mas "The Unarchiver", id: 425424353
brew "stow"           # dotfile symlinker
cask "pearcleaner"    # app deleter
cask "helium-browser" # chromium
cask "tailscale-app"  # VPN
